## Python Pandas Tutorial 8. Concat Dataframes

In [40]:
import pandas as pd

india_weather = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
    "humidity": [80, 60, 78]
})
india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [41]:
us_weather = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
    "humidity": [68, 65, 75]
})
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [42]:
# df = pd.concat([india_weather, us_weather]) # stacks, but keeps org index (duplicates)
# df = pd.concat([india_weather, us_weather], ignore_index=True) 
df = pd.concat([india_weather, us_weather],  keys=["india", "us"]) # double index
# df
df.loc["us"]

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [43]:
temp_df = pd.DataFrame(
    {
        "city": ["mumbai", "delhi", "banglore"],
        "temperature": [32, 45, 30],
    }
)
temp_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [44]:
wind_df = pd.DataFrame(
    {
        "city": ["mumbai", "delhi", "banglore"],
        "windspeed": [3, 4, 0],
    }
)
wind_df

       city  windspeed
0    mumbai          3
1     delhi          4
2  banglore          0

In [ ]:
wind_df = pd.DataFrame(
    {
        "city": ["mumbai", "delhi", "banglore"],
        "windspeed": [3, 4, 0],
    },
    index=[0, 1, 2],
)

temp_df = pd.DataFrame(
    {
        "city": ["mumbai", "banglore", "delhi"],
        "temperature": [32, 45, 30],
    },
    index=[0, 2, 1],  # cities are in diff order. pd.merge() can do this automatically
)

df = pd.concat(
    [
        temp_df,
        wind_df,
    ],
    axis=1,  # append 2nd df as cols, vs 0 = rows
)
df

       city  temperature      city  windspeed
0    mumbai           32    mumbai          3
2  banglore           45  banglore          0
1     delhi           30     delhi          4

In [53]:
temp_df

       city  temperature
0    mumbai           32
2  banglore           45
1     delhi           30

In [58]:
s = pd.Series(["Humid", "Dry", "Rain"], name="event" )
s

0    Humid
1      Dry
2     Rain
Name: event, dtype: object

In [61]:
df  = pd.concat([temp_df,s], axis=1)
df

       city  temperature  event
0    mumbai           32  Humid
2  banglore           45   Rain
1     delhi           30    Dry